	function lucky(){
		var inputAnimal = prompt("당신의 띠를 입력하십시오","쥐띠");
		if(inputAnimal=="" || inputAnimal==null){
			alert("입력값이 없습니다. 당신의 띠를 입력해주십시오.");
		}else if(inputAnimal=="쥐띠" || inputAnimal=="쥐"){
			alert("이달의 쥐띠 운세 : 일이 당신의 생각만큼은 잘 풀리지 않는 한 달 입니다. 꼬인 일만큼이나 마음도 꼬이게 되니 자꾸만 다름 사람에게 짜증을 내게 됩니다. 비록 이렇게 저렇게 마음에 차지 않는 사람이 있겠지만, 그를 탓하는 것보단 조금 더 엄격한 스스로에 대한 반성이 필요할 것입니다. 실패의 후회는 언제나 늦고, 그 뒤의 싸움은 언제나 무익한 법이니 타인에게 실패의 핑계를 돌리고 자신을 위로하는 것은 비겁한 일일 뿐입니다. 먼저 스스로의 잘못과 미숙을 반성하고 독려하는 것이 필요할 것입니다. 자신의 실수를 겸허히 받아들이고 그것을 고칠 수 있다면, 다음 번의 일은 좀 더 순조로울 것임에 틀림없습니다. 사후처리를 두고 쉽게 타인과 다툴 수 있으니 여유로운 마음과 양보하는 마음이 무엇보다도 필요한 한 주 입니다. 들어갈 때와 나올 때의 마음이 다른 것은 사람의 슬픈 생리이니 당신에게 섭섭함이 많이 주어지는 한 주 일지라도 크게 낙담하는 일이 없도록 하십시오.");
		}else if(inputAnimal=="소띠" || inputAnimal=="소"){
			alert("이달의 소띠 운세 : 작은 이익에 모든 것을 건다면 큰 일을 성취할 수 없다. 돈으로 인한 유혹이 여기저기서 생겨날 수 있지만, 가능하면 거절하는 게 이롭다. 재물 이외에 더 좋은 재물을 찾을 수 있게 될 수 있기 때문이다. 주부는 외출을 삼가고 집 안에 머무르는 게 가족의 안녕을 위해서 좋다.");
		}else if(inputAnimal=="호랑이띠" || inputAnimal=="호랑이"){
			alert("이달의 호랑이띠 운세 : 더 나은 미래를 위해 스스로를 단련시키고, 능력 개발을 위해 노력을 해야 할 시기이다. 한 곳에서 정체되어 있지 말고, 부지런히 움직이며 목표를 위해 나아가는 멋진 모습을 보이도록 하라. 위험이 다가오지 못하도록 더욱더 정진 할 때다. ");
		}else if(inputAnimal=="토끼띠" || inputAnimal=="토끼"){
			alert("이달의 토끼띠 운세 : 자신이 생각하고 있었던 좋은 기회들이 몰려오는 하루다. 하지만 다 취할 수 없으니 꼭 품을 수 있는 것만 잡아야 할 것이다. 만약 모든 것을 다 잡고 싶다거나 어떤 것이 당신에게 좋은 것인지를 판단하기 힘들다면, 오늘은 결정을 미뤄라. 하루만 시간을 가지고 신중히 생각하고 내일 선택해도 늦지 않을 것이다. 귀인이 당신에게 후한 선물을 준 하루가 될 것이다. ");	
		}else if(inputAnimal=="용띠" || inputAnimal=="용"){
			alert("이달의 용띠 운세 : 집에 머무르는 시간을 많이 갖는 게 당신에게 유리하다. 그 동안 스쳐간 친구나 동료들에게 안부의 전화라도 한번 걸어보는 게 훗날을 생각하면 유리할 것이다. 자중하면서 앞으로의 계획을 다시 점검하기에 좋은 날이다. 한차례 몸져누울 수도 있으나 곧 털고 일어난다. ");
		}else if(inputAnimal=="뱀띠" || inputAnimal=="뱀"){
			alert("이달의 뱀띠 운세 : 힘든 일이 있으면 즐거운 일도 생기는 법이다. 오늘은 당신에게 어려움을 주었던 일이 해결되어 큰 즐거움을 가져다 줄 것이다. 하지만 너무 서두르게 되면 일을 망치게 되니 끝까지 최선을 다하는 게 좋다. 처음 만나는 상대방이 당신에게 호감을 갖는 날이기도 하다. ");
		}else if(inputAnimal=="말띠" || inputAnimal=="말"){
			alert("이달의 말띠 운세 : 내 주관을 가지고 행동하지 못하고 다른 사람의 의견에 끌려 다니면 오히려 나쁜 결과를 얻을 수도 있는 날이다. 차라리 모든 상황을 뒤로 하고, 마음의 여유를 찾기 위해 기분전환이나 운동을 하는 것이 효율적일 수도 있겠다. ");
		}else if(inputAnimal=="양띠" || inputAnimal=="양"){
			alert("이달의 양띠 운세 : 다른 사람에게 피해가 갈 수도 있으나 대의를 위한 것에 중요성을 두고 진행하는 게 좋다. 옛날 좋지 않았던 인연을 다시 만날 수도 있으나 만반의 대비를 한다면 문제 될 건 없다. 새로운 일을 하려고 한다면, 지금까지 해온 일을 먼저 정리하고 진행하는 게 옳다. ");
		}else if(inputAnimal=="원숭이띠" || inputAnimal=="원숭이"){
			alert("이달의 원숭이띠 운세 : 건강이 최고의 자산이다. 건강을 해치면 아무리 많은 부귀나 높은 지위도 소용없다는 것은 알고 있으니 가벼운 운동으로 건강을 지키려는 노력이 필요하다. 또한, 사회적 지위가 높아질수록 주위사람의 시선이 부담스럽게 느껴질 수 있으니 고개 숙임에 인색하지 않음이 이롭다.");
		}else if(inputAnimal=="닭띠" || inputAnimal=="닭"){
			alert("이달의 닭띠 운세 : 지금은 한 우물을 파야만 나은 결과를 얻을 수 있으니, 여러 곳에 당신의 정력을 낭비하지 말고 한 곳에만 능력을 집중할 필요가 있겠다. 새로운 일에 대해서 지나치게 집착하지 않도록 하라. 당신에게 주어진 본래의 의무가 가장 최선이다. ");
		}else if(inputAnimal=="개띠" || inputAnimal=="개"){
			alert("이달의 개띠 운세 : 서로 다른 생각을 하는 사람들이 모여 있으니 마음이 편치 않을 수도 있는 날이다. 세상 이치도 다 그런거다. 자신이 원하고 생각하는 대로 움직이는 건 하나도 없다고 느껴지는 그런 날이다. 하지만 조만간 음지에 햇볕이 드니 새로이 발생할 것들에 대해 너무 깊이 생각하지 말도록 하라. ");
		}else if(inputAnimal=="돼지띠" || inputAnimal=="돼지"){
			alert("이달의 돼지띠 운세 : 옛날을 돌아보며 지금은 거의 잊혀진 초심을 되살려야 하는 한 달입니다. 앞만 보고 바삐 뛰어온 지금의 당신은 처음 청운의 꿈을 가슴에 품었을 때의 다짐과 이상을 잊고 있습니다. 그저 쫓기듯 다음 일, 또 다음 일을 찾아가는 현재의 생활은 당신을 조금씩 소모시키고 또한 고갈시키고 있습니다. 처음에 뜻을 두었던 멀고 웅장한 목표는 온데간데 없고 누군가로부터 주어진 일을 의심 없이 의욕 없이 따라가고 있을 뿐입니다. 예전에 꾸었던 맑고 큰 꿈을 다시 살려야 할 것입니다. 지금은 잊고 있는 예전의 꿈을 되살리면, 당신이 마지못해 걷고 있는 길에 새로운 표지판이 세워질 지 모릅니다. 멀고 긴 여행을 가기 위해서는 오늘과 내일의 계획을 세워야 하는 만큼 목적지와 그에 이르는 기한도 확실히 세워야 합니다. 처음 세웠던 서툴지만 당당한 계획을 떠올리며 초심을 다시 살리는 것이 당신에게 도움이 되어줄 것입니다. ");
		}else{ alert("본인의 띠를 입력하십시오");}
	}
		function test(){
		window.open("test.html", "test", "width=400 height=500 left=150 top=100 menubar=no location=no, resizable=no, toolbar=no");
	}